# Homework - SQL2

1. Use Google Colabortory and do your homework.
3. (In Google colaboratory) Before you submit your homework, restart kernel and run every cell!
4. Save (File->Save) the file
5. Submit your homework (this file) in Google classroom
6. **Don't forget to click "제출" button** ("Submit", "완료로 표시", 또는 "제출" 버턴을 누르지 않으면 제출된 것이 아님)
7. No late homeworks will be accepted for any reason!

- 권고사항: 모든 SQL select 문에 tuple variable를 사용할 것.

- SQL 작성시, 문제에 주어지지 않은 상수를 사용하는 경우 (cheating), **마이너스 점수**를 받는다.

- **점수: 각 10점, 18번 20점, 총200점**

In [ ]:
%load_ext sql

In [ ]:
!pip install pymysql

Collecting pymysql
  Downloading https://files.pythonhosted.org/packages/1a/ea/dd9c81e2d85efd03cfbf808736dd055bd9ea1a78aea9968888b1055c3263/PyMySQL-0.10.1-py2.py3-none-any.whl (47kB)
     |████████████████████████████████| 51kB 4.7MB/s
Installing collected packages: pymysql
Successfully installed pymysql-0.10.1

### Use your host, id, password, and database

··········

'Connected: admin@companydb'

## Warning: Your companydb state MUST be clean as initial state

- Refer to jupyter notebook on "SQL Lab on AWS RDS"

### When you list the name of employees, the name must be the following format:

- Output Schema and tuple format:

```
+------------------+
| Employee name    |
+------------------+
| John B. Smith    |
...
+------------------+
```

- Use MySQL concat 함수 사용, Refer to MySQL manual or  Googling

### 1-13번에 대해 SQL select 문을 작성하고 MySQL에서 실행한 결과물을 제출하시오.

#### 1. Retrieve the names of employees in department 5 who work more than 10 hours per week on the 'ProductX' project. (single SELECT 사용, MySQL concat 함수 사용)

In [ ]:
%%sql     10
select concat(Fname, ' ', Minit, '. ', Lname) as 'Employee name'
from EMPLOYEE, PROJECT, WORKS_ON
where Dno = Dnum and Pnumber = Pno and Ssn = Essn and
      Pname = 'ProductX' and Hours > 10 and dno='5'

 * mysql+pymysql://admin:***@yeeundb.cqxj696ehu1o.us-east-1.rds.amazonaws.com:3306/companydb
2 rows affected.

[('John B. Smith',), ('Joyce A. English',)]


#### 2.  List the names of employees who have a dependent with the same sex as themselves. (EXISTS 사용)

In [ ]:
%%sql     10
select concat(Fname, ' ', Minit, '. ', Lname) as 'Employee name'
from EMPLOYEE
where exists (select *
              from DEPENDENT
              where Ssn = Essn and EMPLOYEE.Sex = DEPENDENT.Sex)

 * mysql+pymysql://admin:***@yeeundb.cqxj696ehu1o.us-east-1.rds.amazonaws.com:3306/companydb
2 rows affected.

[('John B. Smith',), ('Franklin T. Wong',)]

#### 3.  Find the names of employees that are directly supervised by 'Franklin Wong'. (EXISTS 사용)

In [ ]:
%%sql     10
select concat(Fname, ' ', Minit, '. ', Lname) as 'Employee name'
from EMPLOYEE E
where exists (select *
              from EMPLOYEE S
              where S.Fname = 'Franklin' and S.Lname = 'Wong' and S.Ssn = E.Superssn)

 * mysql+pymysql://admin:***@yeeundb.cqxj696ehu1o.us-east-1.rds.amazonaws.com:3306/companydb
3 rows affected.

[('John B. Smith',), ('Joyce A. English',), ('Ramesh K. Narayan',)]

#### 4.  For each project, list the project name and the total hours per week (by all employees) spent on that project.
Output Schema:
```
+-----------------+-------------+
| Project name    | Total hours |
+-----------------+-------------+
```

In [ ]:
%%sql     10
select Pname as 'Project name', sum(Hours) as 'Total hours'
from PROJECT, WORKS_ON
where Pnumber = Pno 
group by Pno

 * mysql+pymysql://admin:***@yeeundb.cqxj696ehu1o.us-east-1.rds.amazonaws.com:3306/companydb
6 rows affected.

[('Computerization', Decimal('55.0')),
 ('Newbenefits', Decimal('55.0')),
 ('ProductX', Decimal('52.5')),
 ('ProductY', Decimal('37.5')),
 ('ProductZ', Decimal('50.0')),
 ('Reorganization', Decimal('25.0'))]

#### 5.  Retrieve the names of employees who work on every project managed by 'Administration' department.

In [ ]:
%%sql     10
SELECT CONCAT(E.FNAME, ' ', E.MINIT,'. ', E.LNAME) as 'Employee name'
FROM EMPLOYEE E
WHERE NOT EXISTS (
      SELECT *
      FROM PROJECT P, DEPARTMENT D
      WHERE Dname = 'Administration' AND D.Dnumber = P.Dnum and 
            NOT EXISTS (
            SELECT *
            FROM WORKS_ON W
            WHERE E.SSN = W.ESSN AND 
            P.PNUMBER = W.PNO))

 * mysql+pymysql://admin:***@yeeundb.cqxj696ehu1o.us-east-1.rds.amazonaws.com:3306/companydb
2 rows affected.

[('Ahmad V. Jabbar',), ('Alicia J. Zelaya',)]

#### 6.  Retrieve the names of employees who do not work on any project which is located in 'Houston'. (NOT EXISTS 사용)

In [ ]:
%%sql     10
select concat(Fname, ' ', Minit, '. ', Lname) as 'Employee name'
from EMPLOYEE
where not exists (select *
                  from PROJECT, WORKS_ON
                  where Pnumber = Pno and Ssn = Essn and Plocation = 'Houston')

 * mysql+pymysql://admin:***@yeeundb.cqxj696ehu1o.us-east-1.rds.amazonaws.com:3306/companydb
4 rows affected.

[('John B. Smith',),
 ('Joyce A. English',),
 ('Ahmad V. Jabbar',),
 ('Alicia J. Zelaya',)]

#### 7.  For each department, retrieve the department name, and the average salary of employees working in that department.(소수점 이하 2자리까지만 출력, Refer to MySQL manual or  Googling)

Output schema
```
+-----------------+----------------+
| Department name | Average salary |
+-----------------+----------------+
```

In [ ]:
%%sql       10
select Dname as 'Department name', truncate(avg(Salary),2) as 'Average salary'
from EMPLOYEE, DEPARTMENT
where Dno = Dnumber
group by Dname

 * mysql+pymysql://admin:***@yeeundb.cqxj696ehu1o.us-east-1.rds.amazonaws.com:3306/companydb
3 rows affected.

[('Administration', Decimal('31000.00')),
 ('Headquarters', Decimal('55000.00')),
 ('Research', Decimal('33250.00'))]

#### 8.  Retrieve the average salary of all female employees. (소수점 이하 2자리까지만 출력, Refer to MySQL manual or  Googling)
Output Schema:
```
+----------------+
| Average salary |
+----------------+
```

In [ ]:
%%sql     10
select truncate(avg(Salary), 2) as 'Average salary'
from EMPLOYEE
where Sex='F'

 * mysql+pymysql://admin:***@yeeundb.cqxj696ehu1o.us-east-1.rds.amazonaws.com:3306/companydb
1 rows affected.

[(Decimal('31000.00'),)]

#### 9.  Find the names and addresses of employees who work on at least one project located in Houston but whose department has no location in Houston. (EXISTS, NOT EXISTS 사용)

Output schema:

```
+---------------------+-------------------------+
| Employee name       | Address                 |
+---------------------+-------------------------+
```

In [ ]:
%%sql     10
select concat(Fname, ' ', Minit, '. ', Lname) as 'Employee name', Address
from EMPLOYEE
where exists (select *
              from PROJECT, WORKS_ON
              where Pnumber = Pno and Ssn = Essn
              and Plocation = 'Houston')
              and
              not exists (select *
                          from DEPT_LOCATIONS
                          where Dno = Dnumber and Dlocation = 'Houston')

 * mysql+pymysql://admin:***@yeeundb.cqxj696ehu1o.us-east-1.rds.amazonaws.com:3306/companydb
1 rows affected.

[('Jennifer S. Wallace', '291-Berry-Bellaire-TX')]

#### 10.  List the names of department managers who have no dependents. (EXISTS, NOT EXISTS 사용)

In [ ]:
%%sql     10
select concat(Fname, ' ', Minit, '. ', Lname) as 'Employee name'
from EMPLOYEE
where not exists (select *
                  from DEPENDENT
                  where Ssn = Essn)
                  and
                  exists (select *
                          from DEPARTMENT
                          where Ssn = Mgrssn)

 * mysql+pymysql://admin:***@yeeundb.cqxj696ehu1o.us-east-1.rds.amazonaws.com:3306/companydb
1 rows affected.

[('James E. Borg',)]

#### 11. Retrieve the names of all employees who work in the department that has the employee with the highest salary among all employees.

In [ ]:
%%sql     10
select concat(Fname, ' ', Minit, '. ', Lname) as 'Employee name'
from EMPLOYEE
where Salary in (select max(Salary)
                from EMPLOYEE)
            and Dno in (select Dno
                        from EMPLOYEE
                        group by Dno)

 * mysql+pymysql://admin:***@yeeundb.cqxj696ehu1o.us-east-1.rds.amazonaws.com:3306/companydb
1 rows affected.

[('James E. Borg',)]

#### 12-1. Retrieve the names of all employees whose supervisor’s supervisor is James Borg. (EXISTS 안에 EXISTS 사용)

In [ ]:
%%sql     10
select concat(Fname, ' ', Minit, '. ', Lname) as 'Employee name'
from EMPLOYEE E
where exists ((select *
              from EMPLOYEE P
              where exists (select *
                            from EMPLOYEE Y
                            where E.Superssn = P.Ssn and
                                  P.Superssn = Y.Ssn and
                                  Y.Fname = 'James' and Y.Lname = 'Borg')))

 * mysql+pymysql://admin:***@yeeundb.cqxj696ehu1o.us-east-1.rds.amazonaws.com:3306/companydb
5 rows affected.

[('John B. Smith',),
 ('Joyce A. English',),
 ('Ramesh K. Narayan',),
 ('Ahmad V. Jabbar',),
 ('Alicia J. Zelaya',)]

#### 12-2. Retrieve the names of all employees whose supervisor’s supervisor is James Borg. (single SELECT 사용)

In [ ]:
%%sql     10
select concat(E.Fname, ' ', E.Minit, '. ', E.Lname) as 'Employee name'
from EMPLOYEE E, EMPLOYEE P, EMPLOYEE Y
where E.Superssn = P.Ssn and P.Superssn = Y.Ssn and Y.Fname = 'James' and Y.Lname = 'Borg'

 * mysql+pymysql://admin:***@yeeundb.cqxj696ehu1o.us-east-1.rds.amazonaws.com:3306/companydb
5 rows affected.

[('John B. Smith',),
 ('Joyce A. English',),
 ('Ramesh K. Narayan',),
 ('Ahmad V. Jabbar',),
 ('Alicia J. Zelaya',)]

#### 13. Retrieve the names of employees who make at least 10,000 dollars more than the employee who is paid the least in the company.

In [ ]:
%%sql     10
select concat(Fname, ' ', Minit, '. ', Lname) as 'Employee name'
from EMPLOYEE
where Salary > (select min(Salary)
                from EMPLOYEE) + 10000

 * mysql+pymysql://admin:***@yeeundb.cqxj696ehu1o.us-east-1.rds.amazonaws.com:3306/companydb
4 rows affected.

[('Franklin T. Wong',),
 ('Ramesh K. Narayan',),
 ('James E. Borg',),
 ('Jennifer S. Wallace',)]

### 14-17번에 대해 SQL view문을 작성하고 MySQL에서 “select * from <view_name>”을 실행한 결과물을 제출하시오.

#### 14. A view that has the department name, manager name, and manager salary for every department

In [ ]:
%%sql     10
drop view if exists DEPT_VIEW;
create view DEPT_VIEW
as select Dname, concat(Fname, ' ', Minit, '. ', Lname) as 'Mgr name', Salary
from EMPLOYEE, DEPARTMENT
where Dnumber = Dno and Mgrssn = Ssn

 * mysql+pymysql://admin:***@yeeundb.cqxj696ehu1o.us-east-1.rds.amazonaws.com:3306/companydb
0 rows affected.
0 rows affected.

[]

In [ ]:
%sql select * from DEPT_VIEW;

 * mysql+pymysql://admin:***@yeeundb.cqxj696ehu1o.us-east-1.rds.amazonaws.com:3306/companydb
3 rows affected.

[('Headquarters', 'James E. Borg', Decimal('55000.00')),
 ('Administration', 'Jennifer S. Wallace', Decimal('43000.00')),
 ('Research', 'Franklin T. Wong', Decimal('40000.00'))]

#### 15. A view that has the employee name, supervisor name, and employee salary for each employee who works in the ‘Research’ department

In [ ]:
%%sql   10
drop view if exists RESEARCH_DEPT_VIEW;
create view RESEARCH_DEPT_VIEW
as select concat(E.Fname, ' ', E.Minit, '. ', E.Lname) as 'Employee name', 
          concat(M.Fname, ' ', M.Minit, '. ', M.Lname) as 'Mgr name', E.Salary
from EMPLOYEE E, EMPLOYEE M, DEPARTMENT
where Dnumber = E.Dno and Dname = 'Research' and E.Superssn = M.Ssn

 * mysql+pymysql://admin:***@yeeundb.cqxj696ehu1o.us-east-1.rds.amazonaws.com:3306/companydb
0 rows affected.
0 rows affected.

[]

In [ ]:
%sql select * from RESEARCH_DEPT_VIEW;

 * mysql+pymysql://admin:***@yeeundb.cqxj696ehu1o.us-east-1.rds.amazonaws.com:3306/companydb
4 rows affected.

[('John B. Smith', 'Franklin T. Wong', Decimal('30000.00')),
 ('Franklin T. Wong', 'James E. Borg', Decimal('40000.00')),
 ('Joyce A. English', 'Franklin T. Wong', Decimal('25000.00')),
 ('Ramesh K. Narayan', 'Franklin T. Wong', Decimal('38000.00'))]

#### 16. A view that has the project name, controlling department name, number of employees, and total hours worked per week on the project for each project

In [ ]:
%%sql     10
drop view if exists PROJECT_VIEW;
create view PROJECT_VIEW(Pname, Dname, Emp_num, Total_hours)
as select Pname, Dname, Count(*), sum(Hours)
from PROJECT, DEPARTMENT, WORKS_ON
where Dnum = Dnumber and Pnumber = Pno
group by Pname

 * mysql+pymysql://admin:***@yeeundb.cqxj696ehu1o.us-east-1.rds.amazonaws.com:3306/companydb
0 rows affected.
0 rows affected.

[]

In [ ]:
%sql select * from PROJECT_VIEW;

 * mysql+pymysql://admin:***@yeeundb.cqxj696ehu1o.us-east-1.rds.amazonaws.com:3306/companydb
6 rows affected.

[('ProductX', 'Research', 2, Decimal('52.5')),
 ('ProductY', 'Research', 3, Decimal('37.5')),
 ('ProductZ', 'Research', 2, Decimal('50.0')),
 ('Computerization', 'Administration', 3, Decimal('55.0')),
 ('Reorganization', 'Headquarters', 3, Decimal('25.0')),
 ('Newbenefits', 'Administration', 3, Decimal('55.0'))]

#### 17. A view that has the project name, controlling department name, number of employees, and total hours worked per week on the project for each project with more than two employees working on it

In [ ]:
%%sql     10
drop view if exists PROJECT_VIEW_GT2;
create view PROJECT_VIEW_GT2(Pname, Dname, Emp_num, Total_hours)
as select Pname, Dname, Count(*), sum(Hours)
from PROJECT, DEPARTMENT, WORKS_ON
where Dnum = Dnumber and Pnumber = Pno
group by Pname
having count(*) > 2

 * mysql+pymysql://admin:***@yeeundb.cqxj696ehu1o.us-east-1.rds.amazonaws.com:3306/companydb
0 rows affected.
0 rows affected.

[]

In [ ]:
%sql select * from PROJECT_VIEW_GT2;

 * mysql+pymysql://admin:***@yeeundb.cqxj696ehu1o.us-east-1.rds.amazonaws.com:3306/companydb
4 rows affected.

[('ProductY', 'Research', 3, Decimal('37.5')),
 ('Computerization', 'Administration', 3, Decimal('55.0')),
 ('Reorganization', 'Headquarters', 3, Decimal('25.0')),
 ('Newbenefits', 'Administration', 3, Decimal('55.0'))]

#### 18. EMPLOYEE 테이블의 salary의 변경사항이 있을 때 마다, 변경사항을 기록하는 테이블 salary_audit(ssn, before_salary, after_salary, u_datetime)을 만들고, update trigger를 사용하여 변경사항을 기록하시오. 5번 부서에 속하는 직원의 salary를 100% 상향 조정 후, “select * from salary_audit”를 통해 결과를 확인하시오. udatetime에는 수정이 실행된 DATETIME(SQL Datatype, 날짜와 시각)을 기록한다. 현재 시각값은 now() 함수를 통해 얻을 수 있다.

## Warning
- 18번 문제 Update 한 후에 1-17번 문제를 다시 풀면 다른 결과가 나올 수 있음
- 1-17번 문제는 반드시 companydb의 초기 상태에서 풀어야 함

In [ ]:
%%sql     20
drop table if exists salary_audit;
create table salary_audit (
  ssn char(9),
  before_salary decimal(10,2),
  after_salary decimal(10,2),
  udatetime datetime
);

 * mysql+pymysql://admin:***@yeeundb.cqxj696ehu1o.us-east-1.rds.amazonaws.com:3306/companydb
0 rows affected.
0 rows affected.

[]

In [ ]:
%%sql
drop trigger if exists salary_audit_trig;
create trigger salary_audit_trig
after update
on EMPLOYEE
for each row
begin
if new.salary <> old.salary then
	insert into salary_audit values (new.ssn, old.salary, new.salary, now());
end if;
end

 * mysql+pymysql://admin:***@yeeundb.cqxj696ehu1o.us-east-1.rds.amazonaws.com:3306/companydb
0 rows affected.
0 rows affected.

[]

In [ ]:
%sql select * from salary_audit;

 * mysql+pymysql://admin:***@yeeundb.cqxj696ehu1o.us-east-1.rds.amazonaws.com:3306/companydb
0 rows affected.

[]

In [ ]:
%sql update EMPLOYEE set salary = 2 * salary where dno = 5;

 * mysql+pymysql://admin:***@yeeundb.cqxj696ehu1o.us-east-1.rds.amazonaws.com:3306/companydb
4 rows affected.

[]

In [ ]:
%sql select * from salary_audit;

 * mysql+pymysql://admin:***@yeeundb.cqxj696ehu1o.us-east-1.rds.amazonaws.com:3306/companydb
4 rows affected.

[('123456789', Decimal('30000.00'), Decimal('60000.00'), datetime.datetime(2020, 12, 4, 6, 36, 46)),
 ('333445555', Decimal('40000.00'), Decimal('80000.00'), datetime.datetime(2020, 12, 4, 6, 36, 46)),
 ('453453453', Decimal('25000.00'), Decimal('50000.00'), datetime.datetime(2020, 12, 4, 6, 36, 46)),
 ('666884444', Decimal('38000.00'), Decimal('76000.00'), datetime.datetime(2020, 12, 4, 6, 36, 46))]